const express = require('express');
var router = express.Router();
var dateFormat = require('dateformat');

//ACCESS ROUTER CALMENU
router.get('/', function(req, res){
    console.log("[calmenu] 식단 불러오기 성공" + " [ " + dateFormat(Date(), "yyyy-mm-dd, h:MM:ss TT") + " ] " )
    var responseData = {
        "check": true,
        "code": 200,
        "menu":[
            {"일자":"2021-07-01", "아침":[["잡곡밥","동태매운탕","피자","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-02", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-07-03", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-07-04", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-05", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-07-06", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-07", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-08", "아침":[["잡곡밥","동태매운탕","피자","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-09", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-07-10", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-07-11", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-12", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-07-13", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-14", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-15", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-07-16", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-07-17", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-18", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-07-19", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-20", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-21", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-07-22", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-07-23", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-24", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-07-25", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-26", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-27", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-07-28", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-29", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-30", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-07-31", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]}
            
            ,{"일자":"2021-08-01", "아침":[["잡곡밥","동태매운탕","피자","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-02", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-08-03", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-08-04", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-05", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-08-06", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-07", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-08", "아침":[["잡곡밥","동태매운탕","피자","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-09", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-08-10", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-08-11", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-12", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-08-13", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-14", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-15", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-08-16", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-08-17", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-18", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-08-19", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-20", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-21", "아침":[["쌀밥","콩나물국","치킨","핫도그"]], "점심":[["쌀밥","감자탕"," 미역초장","아이스크림"],["쌀밥","아이스아메리카노"," 숙주나물","포기김치"]], "저녁":[["보리밥","된장국","파래무무침","소세지볶음"]]},
            {"일자":"2021-08-22", "아침":[["쌀밥","감자양파국","떡볶이","오이생채"]], "점심":[["쌀밥","두부국"," 계란찜","포기김치"],["쌀밥","된장찌개"," 청포묵무침","배추김치"]], "저녁":[["보리밥","버섯된장국","닭볶음탕","소세지볶음"]]},
            {"일자":"2021-08-23", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-24", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-08-25", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-26", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-27", "아침":[["쌀밥","떡만두국","오이소박이","장조림"]], "점심":[["쌀밥","돼지국밥"," 훈제오리","배추김치"],["쌀밥","짬뽕"," 탕수육","배추김치"]], "저녁":[["보리밥","스테이크","찜닭","호박표버섯볶음"]]},
            {"일자":"2021-08-28", "아침":[["쌀밥","콩나물국","스팸구이","감자볶음"]], "점심":[["쌀밥","된장찌개"," 불고기","배추김치"],["쌀밥","된장찌개"," 불고기","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-29", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-30", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]},
            {"일자":"2021-08-31", "아침":[["쌀밥","청국장","가지나물","포기김치"]], "점심":[["쌀밥","김치국"," 소시지전","시금치나물"],["쌀밥","감자국"," 감자채볶음","배추김치"]], "저녁":[["보리밥","미역국","계란말이","소세지볶음"]]}
        ]  
    };
    res.json(responseData);
});


module.exports = router;









