const express = require('express');
var router = express.Router();
var dateFormat = require('dateformat');

//ACCESS ROUTER CALMENU
router.get('/', function(req, res){
    console.log("[calmenu] 8월달 식단을 요청하였습니다." + " [ " + dateFormat(Date(), "yyyy-mm-dd, h:MM:ss TT") + " ] " )
    var responseData = {
        "check": true,
        "code": 200,
        "menu":[
            {"일자":"2021-08-01", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-02", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-03", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-04", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-05", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-06", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-07", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-08", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-09", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-10", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-11", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-12", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-13", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-14", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-15", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-16", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-17", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-18", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-19", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-20", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-21", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-22", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-23", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-24", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-25", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-26", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-27", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-28", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-29", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-30", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-08-31", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},

            {"일자":"2021-09-01", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-02", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-03", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-04", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-05", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-06", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-07", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-08", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-09", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-10", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-11", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-12", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-13", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-14", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-15", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-16", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-17", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-18", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-19", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-20", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-21", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-22", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-23", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-24", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-25", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-26", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-27", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-28", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-29", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]},
            {"일자":"2021-09-30", "아침":[["준비된 메뉴가\n없습니다."],[]], "점심":[["준비된 메뉴가\n없습니다."],[]], "저녁":[["준비된 메뉴가\n없습니다."],[]]}
        ]  
    };
    res.json(responseData);
});


module.exports = router;









